In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2013-01-01  0.457827 -0.056006 -1.101441 -0.223000
2013-01-02  1.029322  0.516940 -0.286900  0.273663
2013-01-03  0.862458 -0.384488  0.871270  1.281471
2013-01-04  0.894173  0.419753 -1.094294  0.232177
2013-01-05 -1.502125  2.911752 -0.249598 -0.456868
2013-01-06  0.126433  0.445502 -1.530988  1.733140

In [8]:
df2 = pd.DataFrame({
            "A": 1.0,
            "B": pd.Timestamp("20130102"),
            "C": pd.Series(1, index=list(range(4)), dtype="float32"),
            "D": np.array([3] * 4, dtype="int32"),
            "E": pd.Categorical(["test", "train", "test", "train"]),
            "F": "foo",
        })

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [11]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [13]:
df.head()

                   A         B         C         D
2013-01-01  0.457827 -0.056006 -1.101441 -0.223000
2013-01-02  1.029322  0.516940 -0.286900  0.273663
2013-01-03  0.862458 -0.384488  0.871270  1.281471
2013-01-04  0.894173  0.419753 -1.094294  0.232177
2013-01-05 -1.502125  2.911752 -0.249598 -0.456868

In [14]:
df.tail()

                   A         B         C         D
2013-01-02  1.029322  0.516940 -0.286900  0.273663
2013-01-03  0.862458 -0.384488  0.871270  1.281471
2013-01-04  0.894173  0.419753 -1.094294  0.232177
2013-01-05 -1.502125  2.911752 -0.249598 -0.456868
2013-01-06  0.126433  0.445502 -1.530988  1.733140

In [15]:
df.to_numpy()

array([[ 0.45782682, -0.05600552, -1.10144055, -0.22300043],
       [ 1.02932225,  0.5169401 , -0.28690006,  0.2736627 ],
       [ 0.86245795, -0.38448786,  0.87126977,  1.28147104],
       [ 0.89417326,  0.41975326, -1.09429426,  0.23217716],
       [-1.50212535,  2.91175206, -0.24959801, -0.45686803],
       [ 0.12643303,  0.44550206, -1.5309881 ,  1.7331404 ]])

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.311348  0.642242 -0.565325  0.473430
std    0.949024  1.165874  0.864956  0.858881
min   -1.502125 -0.384488 -1.530988 -0.456868
25%    0.209281  0.062934 -1.099654 -0.109206
50%    0.660142  0.432628 -0.690597  0.252920
75%    0.886244  0.499081 -0.258924  1.029519
max    1.029322  2.911752  0.871270  1.733140

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.457827    1.029322    0.862458    0.894173   -1.502125    0.126433
B   -0.056006    0.516940   -0.384488    0.419753    2.911752    0.445502
C   -1.101441   -0.286900    0.871270   -1.094294   -0.249598   -1.530988
D   -0.223000    0.273663    1.281471    0.232177   -0.456868    1.733140

In [20]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.223000 -1.101441 -0.056006  0.457827
2013-01-02  0.273663 -0.286900  0.516940  1.029322
2013-01-03  1.281471  0.871270 -0.384488  0.862458
2013-01-04  0.232177 -1.094294  0.419753  0.894173
2013-01-05 -0.456868 -0.249598  2.911752 -1.502125
2013-01-06  1.733140 -1.530988  0.445502  0.126433

In [21]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03  0.862458 -0.384488  0.871270  1.281471
2013-01-01  0.457827 -0.056006 -1.101441 -0.223000
2013-01-04  0.894173  0.419753 -1.094294  0.232177
2013-01-06  0.126433  0.445502 -1.530988  1.733140
2013-01-02  1.029322  0.516940 -0.286900  0.273663
2013-01-05 -1.502125  2.911752 -0.249598 -0.456868

In [22]:
df['A']

2013-01-01    0.457827
2013-01-02    1.029322
2013-01-03    0.862458
2013-01-04    0.894173
2013-01-05   -1.502125
2013-01-06    0.126433
Freq: D, Name: A, dtype: float64

In [23]:
df[:2]

                   A         B         C         D
2013-01-01  0.457827 -0.056006 -1.101441 -0.223000
2013-01-02  1.029322  0.516940 -0.286900  0.273663

In [24]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  1.029322  0.516940 -0.286900  0.273663
2013-01-03  0.862458 -0.384488  0.871270  1.281471
2013-01-04  0.894173  0.419753 -1.094294  0.232177

In [27]:
df.loc[dates[0]]

A    0.457827
B   -0.056006
C   -1.101441
D   -0.223000
Name: 2013-01-01 00:00:00, dtype: float64

In [28]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.457827 -0.056006
2013-01-02  1.029322  0.516940
2013-01-03  0.862458 -0.384488
2013-01-04  0.894173  0.419753
2013-01-05 -1.502125  2.911752
2013-01-06  0.126433  0.445502

In [29]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  1.029322  0.516940
2013-01-03  0.862458 -0.384488
2013-01-04  0.894173  0.419753

In [32]:
df.loc["20130102", ["A", "B"]]

A    1.029322
B    0.516940
Name: 2013-01-02 00:00:00, dtype: float64

In [33]:
df.loc[dates[0], "A"]

0.4578268204514709

In [34]:
df.at[dates[0], 'A']

0.4578268204514709

In [35]:
df.iloc[3]

A    0.894173
B    0.419753
C   -1.094294
D    0.232177
Name: 2013-01-04 00:00:00, dtype: float64

In [36]:
df.iloc[3:5, :2]

                   A         B
2013-01-04  0.894173  0.419753
2013-01-05 -1.502125  2.911752

In [37]:
df.iloc[[1,2,3], [0,1]]

                   A         B
2013-01-02  1.029322  0.516940
2013-01-03  0.862458 -0.384488
2013-01-04  0.894173  0.419753

In [38]:
df.iloc[1:3, :]

                   A         B        C         D
2013-01-02  1.029322  0.516940 -0.28690  0.273663
2013-01-03  0.862458 -0.384488  0.87127  1.281471

In [39]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.056006 -1.101441
2013-01-02  0.516940 -0.286900
2013-01-03 -0.384488  0.871270
2013-01-04  0.419753 -1.094294
2013-01-05  2.911752 -0.249598
2013-01-06  0.445502 -1.530988

In [40]:
df.iloc[1,1]

0.5169400991918122

In [41]:
df.iat[1,1]

0.5169400991918122